app/Controllers/KelasController.php

    public function input()
    {
        $data = [
            'title' => 'Input Kelas',
            'jurusan' => $this->jurusanModel->findAll(),
            'guru' => $this->guruModel->findAll(),
---
SELECT *
FROM `jurusan`
SELECT *
FROM `guru`