app/Models/GuruModel.php

SELECT *
FROM `guru`
---
    public function getAllGuru()
    {
        return $this->findAll();

SELECT *
FROM `guru`
ORDER BY `created_at` DESC
---
    public function getData($sort)
    {
        $builder = $this->db->table('guru');

        switch ($sort) {
            case 'nama_asc':
                $builder->orderBy('nama_guru', 'ASC');
                break;
            case 'nama_desc':
                $builder->orderBy('nama_guru', 'DESC');
                break;
            case 'status_aktif':
                $builder->where('status', 'Aktif')->orderBy('nama_guru', 'ASC');
                break;
            case 'status_tidak_aktif':
                $builder->where('status', 'Tidak Aktif')->orderBy('nama_guru', 'ASC');
                break;
            case 'status_cuti':
                $builder->where('status', 'Cuti')->orderBy('nama_guru', 'ASC');
                break;
            case 'terlama':
                $builder->orderBy('created_at', 'ASC');
                break;
            case 'terbaru':
            default:
                $builder->orderBy('created_at', 'DESC');
                break;
        }

        return $builder->get()->getResultArray();