app/Models/KelasModel.php

    public function getKelasWithRelations()
    {
        return $this->select('kelas.*, jurusan.nama_jurusan, guru.nama_guru')
            ->join('jurusan', 'kelas.id_jurusan = jurusan.id_jurusan', 'left')
            ->join('guru', 'kelas.id_guru = guru.id_guru','left')
            ->findAll();
---
SELECT `kelas`.*, `jurusan`.`nama_jurusan`, `jurusan`.`kode_jurusan`, `guru`.`nama_guru`
FROM `kelas`
LEFT JOIN `jurusan` ON `kelas`.`id_jurusan` = `jurusan`.`id_jurusan`
LEFT JOIN `guru` ON `kelas`.`id_guru` = `guru`.`id_guru`