app/Models/PembayaranGajiModel.php

    public function getRelationshipDataId($id)
    {
        return $this->select('id_pembayaran_gaji, pembayaran_gaji.*, gaji.jumlah_jam, gaji.id_gaji, gaji.biaya_gaji, guru.nama_guru, guru.id_guru, guru.bidang_studi, pembayaran_gaji.status_pembayaran, pembayaran_gaji.tanggal_bayar')
            ->join('gaji', 'pembayaran_gaji.id_gaji = gaji.id_gaji')
            ->join('guru', 'gaji.id_guru = guru.id_guru')
            ->where('pembayaran_gaji.id_pembayaran_gaji', $id)
            ->first();
---
SELECT `id_pembayaran_gaji`, `pembayaran_gaji`.*, `gaji`.`jumlah_jam`, `gaji`.`id_gaji`, `gaji`.`biaya_gaji`, `guru`.`nama_guru`, `guru`.`id_guru`, `guru`.`bidang_studi`, `pembayaran_gaji`.`status_pembayaran`, `pembayaran_gaji`.`tanggal_bayar`
FROM `pembayaran_gaji`
JOIN `gaji` ON `pembayaran_gaji`.`id_gaji` = `gaji`.`id_gaji`
JOIN `guru` ON `gaji`.`id_guru` = `guru`.`id_guru`
WHERE `pembayaran_gaji`.`id_pembayaran_gaji` = '4'
 LIMIT 1