app/Models/SemesterModel.php

SELECT `semester`.*, `jurusan`.`nama_jurusan`, `jurusan`.`id_jurusan`
FROM `semester`
JOIN `jurusan` ON `jurusan`.`id_jurusan` = `semester`.`id_jurusan`
---
    public function getWithRealtion()
    {
        return $this->select('semester.*, jurusan.nama_jurusan , jurusan.id_jurusan')
            ->join('jurusan', 'jurusan.id_jurusan = semester.id_jurusan')
            ->findAll();