app/Models/TransaksiModel.php

SELECT SUM(`nominal`) AS `nominal`
FROM `transaksi`
WHERE `jenis_transaksi` = 'pemasukan'
AND MONTH(tanggal) = '12'
AND YEAR(tanggal) = '2025'
---
    public function getTotalPemasukan($bulan = null, $tahun = null)
    {
        $builder = $this->builder();
        $builder->selectSum('nominal');
        $builder->where('jenis_transaksi', 'pemasukan');

        if ($bulan) {
            $builder->where('MONTH(tanggal)', $bulan);
        }
        if ($tahun) {
            $builder->where('YEAR(tanggal)', $tahun);
        }

        $result = $builder->get()->getRowArray();

SELECT SUM(`nominal`) AS `nominal`
FROM `transaksi`
WHERE `jenis_transaksi` = 'pengeluaran'
AND MONTH(tanggal) = '12'
AND YEAR(tanggal) = '2025'
---
    public function getTotalPengeluaran($bulan = null, $tahun = null)
    {
        $builder = $this->builder();
        $builder->selectSum('nominal');
        $builder->where('jenis_transaksi', 'pengeluaran');

        if ($bulan) {
            $builder->where('MONTH(tanggal)', $bulan);
        }
        if ($tahun) {
            $builder->where('YEAR(tanggal)', $tahun);
        }

        $result = $builder->get()->getRowArray();

SELECT SUM(`nominal`) AS `nominal`
FROM `transaksi`
WHERE `jenis_transaksi` = 'pemasukan'
AND `tanggal` >= '2025-12-01'
AND `tanggal` <= '2025-11-30'
---
    public function getTotalPemasukanByDateRange($startDate, $endDate)
    {
        $builder = $this->builder();
        $builder->selectSum('nominal');
        $builder->where('jenis_transaksi', 'pemasukan');
        $builder->where('tanggal >=', $startDate);
        $builder->where('tanggal <=', $endDate);
        $result = $builder->get()->getRowArray();

SELECT SUM(`nominal`) AS `nominal`
FROM `transaksi`
WHERE `jenis_transaksi` = 'pengeluaran'
AND `tanggal` >= '2025-12-01'
AND `tanggal` <= '2025-11-30'
---
    public function getTotalPengeluaranByDateRange($startDate, $endDate)
    {
        $builder = $this->builder();
        $builder->selectSum('nominal');
        $builder->where('jenis_transaksi', 'pengeluaran');
        $builder->where('tanggal >=', $startDate);
        $builder->where('tanggal <=', $endDate);
        $result = $builder->get()->getRowArray();